import UIKit

var greeting = "Hello, playground"

// 構造体とクラス(Structures and Classes)
// データをカプセル化する独自のデータ型をモデル化する。

// 構造体とクラスは、プログラムのコードの構成要素を構築する汎用的で柔軟な構造概念です。
// 定数、変数、関数の定義に使用するのと同じ構文を使用して、プロパティとメソッドを定義して機能を追加します。

// 他のプログラミング言語とは異なり、Swift では、インターフェイスと実装ファイルを別々に作成する必要はありません。
// 構造体またはクラスを 1 つのファイルで定義すると、その外部インターフェイスは自動的に他のコードで使用できるようになります。

// 定義構文(Definition Syntax)
// 構造体とクラスの定義構文は似ています。
// struct キーワードを使用して構造体を作成し、class キーワードを使用してクラスを作成します。
// どちらも、定義全体を中括弧のペア({})内に配置します:
struct SomeStructure {
    // 構造体の定義をここに
}
class SomeClass {
    // クラスの定義をここに
}



